RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
HXMavlinkParser mavlinkParserIn(true);

//===================================================================================
//===================================================================================
// Returns whether runtime camera detection identified an exact OV5640 sensor.
static bool camera_is_ov5640()
{
    return s_camera_sensor_pid == OV5640_PID;
}

//===================================================================================
//===================================================================================
// Returns whether runtime camera detection identified an OV3660 sensor.
static bool camera_is_ov3660()
{
    return s_camera_sensor_pid == OV3660_PID;
}

//===================================================================================
//===================================================================================
// Returns whether the detected sensor uses the OV5640-family timing and control path.
static bool camera_uses_ov5640_mode_table()
{
    return (s_camera_sensor_pid == OV5640_PID) || (s_camera_sensor_pid == OV3660_PID);
}

//=============================================================================================
//=============================================================================================
void initialize_status_led()
{
#ifdef STATUS_LED_PIN
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << STATUS_LED_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
    gpio_set_level(STATUS_LED_PIN, STATUS_LED_OFF);
}
#endif

#ifdef STATUS_LED2_PIN
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << STATUS_LED2_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
    gpio_set_level(STATUS_LED2_PIN, STATUS_LED2_OFF);
}
#endif
}

#ifdef ESP32CAM_FLASH_LED_PIN
static bool s_last_flash_led_state = true;

//=============================================================================================
//=============================================================================================
void enable_esp32cam_flash_led_pin( bool enabled )
{
    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
}

//=============================================================================================
//=============================================================================================
void initialize_esp32cam_flash_led_pin( bool enabled )
{
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << ESP32CAM_FLASH_LED_PIN,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);

    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
}

//=============================================================================================
//=============================================================================================
bool read_esp32cam_flash_led_pin()
{
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_INPUT );
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_PULLDOWN_ONLY); 
    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN,0);

    bool state = gpio_get_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN) == 1;

    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN, s_last_flash_led_state ? 0 : 1);
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_FLOATING); 
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_OUTPUT );
    
    return state;
}
#endif

#ifdef REC_BUTTON_PIN
//=============================================================================================
//=============================================================================================
void initialize_rec_button()
{
    printf("Init REC button...\n");

    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << REC_BUTTON_PIN,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE };
    gpio_config(&io_conf);
}

static bool s_rec_button_led_state = true;

//=============================================================================================
//=============================================================================================
bool read_rec_button_pin()
{
    gpio_set_pull_mode((gpio_num_t)REC_BUTTON_PIN, GPIO_PULLUP_ONLY); 
    esp_rom_delay_us(20); //charge pin

    bool state = gpio_get_level((gpio_num_t)REC_BUTTON_PIN) == 0;

    gpio_set_pull_mode((gpio_num_t)REC_BUTTON_PIN, s_rec_button_led_state ? GPIO_PULLDOWN_ONLY : GPIO_PULLUP_ONLY); 

    return state;
}

#ifdef HAS_REC_BUTTON_LED
//=============================================================================================
//=============================================================================================
void enable_rec_button_led( bool enabled )
{
    s_rec_button_led_state = enabled;
    gpio_set_pull_mode((gpio_num_t)REC_BUTTON_PIN, s_rec_button_led_state ? GPIO_PULLDOWN_ONLY : GPIO_PULLUP_ONLY); 
}
#endif //rec button led
#endif //rec button


//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t micros()
{
    return esp_timer_get_time();
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t millis()
{
    return esp_timer_get_time() / 1000ULL;
}

//=============================================================================================
//=============================================================================================
void set_status_led(bool enabled)
{
#ifdef STATUS_LED_PIN
    gpio_set_level(STATUS_LED_PIN, enabled ? STATUS_LED_ON : STATUS_LED_OFF);
#endif    

#ifdef STATUS_LED2_PIN
    gpio_set_level(STATUS_LED2_PIN, enabled ? STATUS_LED2_ON : STATUS_LED2_OFF);
#endif    

#ifdef ESP32CAM_FLASH_LED_PIN
    enable_esp32cam_flash_led_pin(enabled);
#endif    

