RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    const size_t CHUNK_SIZE = 8 * 1024; // 8 KB
    const size_t TOTAL_SIZE = 100 * 1024 * 1024; // 100 MB
    size_t written = 0;
    uint8_t* buffer = (uint8_t*)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_DMA);
    //uint8_t* buffer2 = (uint8_t*)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM);
    if (!buffer) 
    {
        LOG("Error: Cannot allocate buffer\n");
        fclose(file);
        return;
    }

    // Fill buffer with a pattern for identification
    memset(buffer, 0xAA, CHUNK_SIZE);

    int64_t start_time = esp_timer_get_time();
    int64_t last_yield_time = start_time;

    while (written < TOTAL_SIZE) {
        size_t to_write = CHUNK_SIZE;
        if (written + to_write > TOTAL_SIZE) {
            to_write = TOTAL_SIZE - written;
        }

        //memcpy(buffer, buffer2, to_write);

        size_t result = fwrite(buffer, 1, to_write, file);
        if (result != to_write) {
            LOG("Error: fwrite failed, wrote %lu instead of %lu\n", result, to_write);
            break;
        }

        written += result;

        // Flush to ensure data is written
        fflush(file);

        // Calculate progress (using integer arithmetic for compatibility)
        int64_t current_time = esp_timer_get_time();
        int64_t elapsed_micros = current_time - start_time;
        size_t mb = written / (1024ULL * 1024ULL);
        size_t percent = (written * 100ULL) / TOTAL_SIZE;
        size_t seconds = elapsed_micros / 1000000ULL;
        size_t tenth_second = (elapsed_micros / 100000ULL) % 10ULL;

        double speed_bps = written / (elapsed_micros / 1000000.0);
        size_t speed_kb = (size_t)(speed_bps / 1024.0);

        // Check if 100ms have passed since last yield
        int64_t now = esp_timer_get_time();
        if (now - last_yield_time > 100000) 
        { // 100ms in microseconds
            vTaskDelay(1); // minimal yield
            last_yield_time = now;

            char logbuf[256];
            sprintf(logbuf, "Progress: %lu MB (%lu%%) written in %lu.%lu seconds. Speed: %lu KB/s\n",
                    (unsigned long)mb, (unsigned long)percent, (unsigned long)seconds, (unsigned long)tenth_second, (unsigned long)speed_kb);
            LOG("%s", logbuf);
        }

    }

    fclose(file);
    free(buffer);

    if (written >= TOTAL_SIZE) {
        LOG("File benchmark completed: %lu bytes written successfully\n", written);
    } else {
        LOG("File benchmark stopped early: %lu bytes written\n", written);
    }
}

//=============================================================================================
//=============================================================================================
void updateSDInfo()
{
    if ( !s_sd_initialized) return;

    /* Get volume information and free clusters of sdcard */
    FATFS *fs;
    DWORD free_clust ;
    auto res = f_getfree("/sdcard/", &free_clust, &fs);
    if (res == 0 ) 
    {
        DWORD free_sect = free_clust * fs->csize;
        DWORD tot_sect = fs->n_fatent * fs->csize;

        SDFreeSpaceGB16 = free_sect / 2 / 1024 / (1024/16);
        SDTotalSpaceGB16 = tot_sect / 2 / 1024 / (1024/16);
	}
}

static bool init_sd()
{
    if (s_sd_initialized) return true;

    SDTotalSpaceGB16 = 0;
    SDFreeSpaceGB16 = 0;

#ifdef SD_CARD_MMC
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 2,
        .allocation_unit_size = 0,
        .disk_status_check_enable = false,
        .use_one_fat = false };

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    // By default, SD card frequency is initialized to SDMMC_FREQ_DEFAULT (20MHz)
    // For setting a specific frequency, use host.max_freq_khz (range 400kHz - 20MHz for SDSPI)
    // Example: for fixed frequency of 10MHz, use host.max_freq_khz = 10000;    
    //host.max_freq_khz = SDMMC_FREQ_PROBING;
    host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
    host.flags = SDMMC_HOST_FLAG_1BIT;

    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width = 1;
#ifdef SD_CLK_PIN    
    slot_config.clk = SD_CLK_PIN;
    slot_config.cmd = SD_CMD_PIN;
    slot_config.d0 = SD_D0_PIN;
#endif    

    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    
    LOG("Mounting SD card...\n");
    esp_err_t ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    if (ret != ESP_OK)
    {
        LOG("Failed to mount SD card VFAT filesystem. Error: %s\n", esp_err_to_name(ret));
#ifdef BOARD_ESP32CAM
        //to turn the flash LED off
        gpio_set_pull_mode((gpio_num_t)4, GPIO_PULLDOWN_ONLY);
#endif        
        return false;
    }
#endif //SD_CARD_MMC

#ifdef SD_CARD_SPI
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 2,
        .allocation_unit_size = 0,
        .disk_status_check_enable = false, 
        .use_one_fat = false,
        };

    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    //host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
    //host.max_freq_khz = SDMMC_FREQ_PROBING;
    //host.max_freq_khz = SDMMC_FREQ_DEFAULT;
    //host.max_freq_khz = 10000;


    spi_bus_config_t bus_cfg = {
        .mosi_io_num = SD_DI_PIN,
        .miso_io_num = SD_DO_PIN,
        .sclk_io_num = SD_CLK_PIN,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .data4_io_num = -1,
        .data5_io_num = -1,
        .data6_io_num = -1,
        .data7_io_num = -1,
        .max_transfer_sz = 4000,
        .flags = 0,
        .intr_flags = 0        
    };

    esp_err_t ret = spi_bus_initialize((spi_host_device_t)host.slot, &bus_cfg, SDSPI_DEFAULT_DMA);
    if (ret != ESP_OK) 
    {
        LOG("Failed to initialize SD SPI bus.");
        return false;
    }
    
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs = SD_CS_PIN;
    slot_config.host_id = (spi_host_device_t)host.slot;
    //slot_config.wait_for_miso = -1; 

    gpio_set_pull_mode(SD_DO_PIN, GPIO_PULLUP_ONLY);
    gpio_set_pull_mode(SD_DI_PIN, GPIO_PULLUP_ONLY);
    gpio_set_pull_mode(SD_CS_PIN, GPIO_PULLUP_ONLY);
    //slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP; - no .flag

    LOG("Mounting SD card...\n");
    ret = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot_config, &mount_config, &card);
    if (ret != ESP_OK)
    {
        LOG("Failed to mount SD card VFAT filesystem. Error: %s\n", esp_err_to_name(ret));
        return false;
    }
#endif //SD_CARD_SPI

    LOG("sd card inited!\n");
    s_sd_initialized = true;

