RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    // Card has been initialized, print its properties
    sdmmc_card_print_info(stdout, card);

    updateSDInfo();

    //find the latest file number
    char buffer[64];
    for (uint32_t i = 0; i < 100000; i++)
    {
#ifdef WRITE_RAW_MJPEG_STREAM 
        sprintf(buffer, "/sdcard/v%03lu_000.mpg", (long unsigned int)i);
#else        
        sprintf(buffer, "/sdcard/v%03lu_000.avi", (long unsigned int)i);
#endif        
        FILE* f = fopen(buffer, "rb");
        if (f)
        {
            fclose(f);
            continue;
        }
        s_sd_next_session_id = i;
        s_sd_next_segment_id = 0;
        break;
    }

/*
    // Run file benchmark after SD initialization
    if (s_sd_initialized) 
    {
        run_file_benchmark();
    }
*/

    return true;
}

static int open_sd_file()
{
    char buffer[64];
#ifdef WRITE_RAW_MJPEG_STREAM
    sprintf(buffer, "/sdcard/v%03lu_%03lu.mpg", (long unsigned int)s_sd_next_session_id, (long unsigned int)s_sd_next_segment_id);
#else
    sprintf(buffer, "/sdcard/v%03lu_%03lu.avi", (long unsigned int)s_sd_next_session_id, (long unsigned int)s_sd_next_segment_id);
#endif

    int fd = open(buffer, O_WRONLY | O_CREAT | O_TRUNC, S_IRUSR | S_IWUSR);

    if (fd == -1)
    {
        LOG("error to open sdcard session %s!\n",buffer);
        return-1;
    }

    LOG("Opening session file '%s'\n", buffer);
    s_sd_file_size = 0;
    s_sd_next_segment_id++;

    return fd;
}


#ifdef WRITE_RAW_MJPEG_STREAM
//=============================================================================================
//=============================================================================================
//this will write data from the slow queue to raw MJPEG file
static void sd_write_proc(void*) //s_sd_write_task MJPEG
{
    while (true)
    {
        if (!s_air_record || (s_shouldRestartRecording > esp_timer_get_time()))
        {
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            continue;
        }
        
        s_shouldRestartRecording = 0;

        int fd = open_sd_file();
        if ( fd == -1)
        {
            s_air_record = false;
            SDError = true;
            vTaskDelay(1000 / portTICK_PERIOD_MS); 
            continue;
        }

        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
        s_sd_slow_buffer->clear();

#ifdef PROFILE_CAMERA_DATA
        s_profiler.set(PF_CAMERA_SD_SLOW_BUF, 0 );
#endif

        xSemaphoreGive(s_sd_slow_buffer_mux);

        bool error = false; 
        bool done = false;
        bool syncFrameStart = true;
        int offset = 0;

        while (!done)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            while (true) //consume all the buffer
            {
                if (!s_air_record)
                {
                    LOG("Done recording, closing file\n", s_sd_file_size);
                    done = true;
                    break;
                }

                if ( s_shouldRestartRecording != 0) 
                {
                    done = true;
                    break;
                }

                int len = SD_WRITE_BLOCK_SIZE - offset;

                xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                bool read = s_sd_slow_buffer->read(&(sd_write_block[offset]), len);
#ifdef PROFILE_CAMERA_DATA    
                s_profiler.set(PF_CAMERA_SD_SLOW_BUF, s_sd_slow_buffer->size() / (SD_SLOW_BUFFER_SIZE_PSRAM / 100 ));
#endif
                xSemaphoreGive(s_sd_slow_buffer_mux);
                if (!read)
                {
                    break; //not enough data, wait
                }

                if ( syncFrameStart )
                {
                    while ( (len >= 3) && ((sd_write_block[offset] != 0xff) || (sd_write_block[offset+1] != 0xd8) || (sd_write_block[offset+2] != 0xff))) 
                    {
                        offset++;
                        len--;
                    }

                    if ( len < 3 ) 
                    {
                        offset = 0;
                        continue;
                    }
                    else
                    {
                        //LOG("Sync = %d %d 0x%02x 0x%02x\n", offset, len, (int)sd_write_block[offset], (int)sd_write_block[offset+1]);
                        syncFrameStart = false;
                        if ( offset > 0 )
                        {
                            memcpy(sd_write_block, sd_write_block+offset, len);
                            offset = len;
                            continue;
                        }
                    }
                }

                offset = 0;
                
                if (write(fd, sd_write_block, SD_WRITE_BLOCK_SIZE) < 0 )
                {
                    LOG("Error while writing! Stopping session\n");
                    done = true;
                    error = true;
                    SDError = true;
                    break;
                }
                s_stats.sd_data += SD_WRITE_BLOCK_SIZE;
                s_sd_file_size += SD_WRITE_BLOCK_SIZE;
                if (s_sd_file_size > 50 * 1024 * 1024)
                {
                    LOG("Max file size reached: %d. Restarting session\n", s_sd_file_size);
                    done = true;
                    break;
                }
            }  //while true -consume all buffer
        }  //while !done

        if (!error)
        {
            fsync(fd);
            close(fd);

            updateSDInfo();
        }
        else
        {
            s_air_record = false;
            //shutdown_sd();
        }
    }
}
#else


//=============================================================================================
//=============================================================================================
bool findFrameStart(Circular_Buffer* buffer, uint32_t &offset, size_t data_avail) 
{
    if ( data_avail <= MJPEG_PATTERN_SIZE*2 ) return false;

    uint32_t maxOffset = data_avail - MJPEG_PATTERN_SIZE*2;

