RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    bool foundZero = false;
    while ( offset < maxOffset )
    {
        if ( buffer->peek(offset) == 0 )
        {
            foundZero = true;
            break;
        }
        else
        {
            offset += MJPEG_PATTERN_SIZE / 2;
        }
    }

    if ( !foundZero )
    {
        return false;
    }

    uint32_t offset1 = offset-1;

    //walk front until buffer contains zeros
    uint32_t count = 0;
    while ( (buffer->peek(offset) == 0) )
    {
        offset++;
        count++;

        if ( offset > (data_avail - 4) )
        {
            //something wrong
            //whole buffer is filled with zeros ?
            return false;
        }
    }

    //count zeros back
    while ( ( count < MJPEG_PATTERN_SIZE / 2 ) && (offset1 > 0) && (buffer->peek(offset1) == 0) )
    {
        offset1--;
        count++;
    }

    return ( 
        (count >= MJPEG_PATTERN_SIZE / 2) && 
        (buffer->peek(offset) == 0xFF ) &&
        (buffer->peek(offset+1) == 0xD8 ) &&
        (buffer->peek(offset+2) == 0xFF ) 
    );
}

//=============================================================================================
//=============================================================================================
void storeBuffer( int fd, size_t count, Circular_Buffer* buffer, SemaphoreHandle_t mux, uint8_t* sd_write_block, size_t& blockSize, size_t& fileSize, bool& done, bool& error)
{
    while (count > 0 )
    {
        size_t len = std::min<size_t>(count, SD_WRITE_BLOCK_SIZE - blockSize);
        
        if (mux != NULL ) xSemaphoreTake(mux, portMAX_DELAY);
        buffer->read( sd_write_block + blockSize, len);
        if (mux != NULL ) xSemaphoreGive(mux);
        count -= len;
        blockSize += len;

        if (blockSize == SD_WRITE_BLOCK_SIZE)
        {
            if (write(fd, sd_write_block, SD_WRITE_BLOCK_SIZE) < 0 )
            {
                LOG("Error while writing! Stopping session\n");
                done = true;
                error = true;
                SDError = true;
                break;
            }
            
            fileSize += SD_WRITE_BLOCK_SIZE;
            blockSize = 0;
            s_stats.sd_data += SD_WRITE_BLOCK_SIZE;
        }
    }
}

//=============================================================================================
//=============================================================================================
//this will write data from the slow queue to AVI file
static void sd_write_proc(void*) //s_sd_write_task AVI
{
    //frames are separated by MJPEG_PATTERN_SIZE zeros
    //frame start search: at least MJPEG_PATTERN_SIZE/2 zero bytes, then FF D8 FF
    //MJPEG_PATTERN_SIZE is 512 bytes, so we can check for zero every 256th byte instead of every byte to find pattern

    while (true)
    {
        if (!s_air_record || (s_shouldRestartRecording > esp_timer_get_time()))
        {
            vTaskDelay(1000 / portTICK_PERIOD_MS);

            //flush frames with possibly different resolution
            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            size_t dataAvail = s_sd_slow_buffer->size();
            s_sd_slow_buffer->skip(dataAvail);
            xSemaphoreGive(s_sd_slow_buffer_mux);

            continue;
        }

        s_shouldRestartRecording = 0;

        int fd = open_sd_file();
        if ( fd == -1)
        {
            s_air_record = false;
            SDError = true;
            vTaskDelay(1000 / portTICK_PERIOD_MS); 
            continue;
        }
        
#if defined(CONFIG_IDF_TARGET_ESP32)
        const TVMode* modeTable = getVModeTable(true);
#else
        const TVMode* modeTable = getVModeTable(false);
#endif
        const TVMode* v = &modeTable[clamp((int)s_ground2air_config_packet2.camera.resolution, 0, (int)(Resolution::COUNT)-1)];
        uint8_t fps = s_ground2air_config_packet2.camera.ov2640HighFPS ? v->highFPS2640 : v->FPS2640;
        if (camera_is_ov3660())
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            // Classic ESP32 always uses the validated OV3660 frame rate.
            fps = v->FPS3660;
#else
            fps = s_ground2air_config_packet2.camera.ov3660HighFPS ? v->highFPS3660 : v->FPS3660;
#endif
        }
        else if (camera_is_ov5640())
        {
            fps = s_ground2air_config_packet2.camera.ov5640HighFPS ? v->highFPS5640 : v->FPS5640;
        }
        uint16_t frameWidth = v->width;
        uint16_t frameHeight = v->height;

        LOG("%dx%d %dfps\n", frameWidth, frameHeight, fps);

        prepAviIndex();

        bool error = false; 
        bool done = false;
        size_t blockSize = AVI_HEADER_LEN; //start with a header
        size_t aviFileSize = AVI_HEADER_LEN;
        bool lookForFrameStart = true;
        uint32_t offset = 0;
        uint32_t frameStartOffset = 0;
        uint32_t frameCnt = 0;
        while (!done)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            if ( s_shouldRestartRecording != 0) 
            {
                done = true;
                break;
            }

            if (!s_air_record)
            {
                LOG("Done recording, closing file\n", s_sd_file_size);
                done = true;
                continue;
            }

            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            size_t dataAvail = s_sd_slow_buffer->size();
            xSemaphoreGive(s_sd_slow_buffer_mux);

            //consume all data
            while ( true )
            {
                if ( lookForFrameStart )
                {
                    if ( findFrameStart( s_sd_slow_buffer, offset, dataAvail ))
                    {
                        lookForFrameStart = false;
                        //offset points to FF D8 FF
                        frameStartOffset = offset;
                    }
                    else
                    {
                        if ( offset > 150*1024)
                        {
                            //something wrong
                            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                            s_sd_slow_buffer->skip(offset);
                            xSemaphoreGive(s_sd_slow_buffer_mux);
                            offset = 0;
                            s_stats.sd_drops++;
                            LOG("Unable to find frame start\n");
                        }
                        break;
                    }
                }

                //next frame start
                if ( findFrameStart( s_sd_slow_buffer, offset, dataAvail ))
                {
#ifdef TEST_AVI_FRAMES                    
                    uint16_t fc = s_sd_slow_buffer->peek(offset + 15);
                    fc <<= 8;
                    fc |=  s_sd_slow_buffer->peek(offset + 14);

                    static uint16_t prevFrameCounter;
                    if (prevFrameCounter+1 !=fc )
                    {
                        LOG("Frame: %d+1 != %d\n", prevFrameCounter, fc);
                    } 
                    prevFrameCounter = fc;
#endif
                    lookForFrameStart = true;
                    //offset points to FF D8 FF
                    //exclude zero patern
                    offset-= MJPEG_PATTERN_SIZE;
                    frameCnt++;

                    //save data from frameStartOffset to offset
                    if ( frameStartOffset > 0 )
                    {
                        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                        s_sd_slow_buffer->skip(frameStartOffset);
                        xSemaphoreGive(s_sd_slow_buffer_mux);
                    }

                    size_t jpegSize = offset - frameStartOffset; 

                    uint16_t filler = (4 - (jpegSize & 0x3)) & 0x3; 
                    size_t jpegSize1 = jpegSize + filler;

