RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                    // add avi frame header
                    uint8_t buf[8];
                    memcpy(buf, dcBuf, 4); 
                    memcpy(&buf[4], &jpegSize1, 4);
                    Circular_Buffer temp(buf, 8, 8);
                    storeBuffer( fd, 8, &temp, NULL, sd_write_block, blockSize, aviFileSize, done, error);
                    if (done) break;

                    //store jpeg
                    storeBuffer( fd, jpegSize, s_sd_slow_buffer, s_sd_slow_buffer_mux, sd_write_block, blockSize, aviFileSize, done, error);
                    dataAvail -= offset;
                    offset = 0;
                    if (done) break;

                    //store filler
                    memset(buf, 0, 4); 
                    Circular_Buffer temp1(buf, 4, 4);
                    storeBuffer( fd, filler, &temp1, NULL, sd_write_block, blockSize, aviFileSize, done, error);

                    buildAviIdx(jpegSize1); // save avi index for frame

                    if (frameCnt == (DVR_MAX_FRAMES-1))
                    {
                        break;
                    }
                }
                else
                {
                    if ( (offset - frameStartOffset) > 150*1024)
                    {
                        //something wrong
                        xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
                        s_sd_slow_buffer->skip(offset);
                        xSemaphoreGive(s_sd_slow_buffer_mux);
                        offset = 0;
                        lookForFrameStart = true;
                        s_stats.sd_drops++;
                        LOG("Unable to find frame end\n");
                    }
                    break;
                }
            }

            if (frameCnt == (DVR_MAX_FRAMES-1))
            {
                LOG("Max frames count reached: %d. Restarting session\n", frameCnt);
                break;
            }

            if (aviFileSize > 50 * 1024 * 1024)
            {
                LOG("Max file size reached: %d. Restarting session\n", aviFileSize);
                break;
            }

            if (done) break;
        }
        
        if (!error)
        {
            // save avi index
            finalizeAviIndex(frameCnt);

            while(true)
            {
                size_t sz = writeAviIndex(sd_write_block + blockSize, SD_WRITE_BLOCK_SIZE - blockSize);
                blockSize += sz;
                if ( (blockSize == SD_WRITE_BLOCK_SIZE) || (sz == 0)) //flush block or write leftover
                {
                    if (write(fd, sd_write_block, blockSize) < 0 )
                    {
                        LOG("Error while writing! Stopping session\n");
                        done = true;
                        error = true;
                        SDError = true;
                        break;
                    }
                    blockSize = 0;
                }
                
                if ( sz == 0)
                {
                    break;
                }
            }

            // save avi header at start of file
            buildAviHdr( fps, frameWidth, frameHeight, frameCnt );

            lseek(fd, 0, SEEK_SET); // start of file
            write(fd, aviHeader, AVI_HEADER_LEN); 
            fsync(fd);
            close(fd);

            updateSDInfo();
        }
        else
        {
            s_air_record = false;
            //shutdown_sd();
        }
    }
}


#endif


//=============================================================================================
//=============================================================================================
//this will move data from the fast queue to the slow queue
static void sd_enqueue_proc(void*)
{
    while (true)
    {
        if (!s_air_record)
        {
            //vTaskDelay(1000 / portTICK_PERIOD_MS);
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification
            continue;
        }

        xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
        s_sd_fast_buffer.clear();

#ifdef PROFILE_CAMERA_DATA    
        s_profiler.set(PF_CAMERA_SD_FAST_BUF, 0);
#endif
        xSemaphoreGive(s_sd_fast_buffer_mux);

        while (true)
        {
            ulTaskNotifyTake(pdTRUE, 1000 / portTICK_PERIOD_MS); //wait for notification

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            size_t size = s_sd_fast_buffer.size();
            if (size == 0)
            {
                xSemaphoreGive(s_sd_fast_buffer_mux);
                continue; //no data? wait some more
            }

            const void* buffer = s_sd_fast_buffer.start_reading(size);
            xSemaphoreGive(s_sd_fast_buffer_mux);

            xSemaphoreTake(s_sd_slow_buffer_mux, portMAX_DELAY);
            if ( !s_sd_slow_buffer->write(buffer, size) )
            {
                s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA    
                s_profiler.toggle(PF_CAMERA_SD_OVF );
#endif
            }

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_SLOW_BUF, s_sd_slow_buffer->size() / (SD_SLOW_BUFFER_SIZE_PSRAM / 100));
#endif
            xSemaphoreGive(s_sd_slow_buffer_mux);

            xSemaphoreTake(s_sd_fast_buffer_mux, portMAX_DELAY);
            s_sd_fast_buffer.end_reading(size);

#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100));
#endif

            xSemaphoreGive(s_sd_fast_buffer_mux);

            if (s_sd_write_task)
                xTaskNotifyGive(s_sd_write_task); //notify task

            if (!s_air_record)
                break;
        }
    }
}

__attribute__((optimize("Os")))
IRAM_ATTR static void add_to_sd_fast_buffer(const void* data, size_t size, bool addFrameStartPattern)
{
    if (xSemaphoreTake(s_sd_fast_buffer_mux, 10 / portTICK_PERIOD_MS) != pdPASS)
    {
        s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_SD_OVF);
#endif
        return;
    }

    bool ok = s_sd_fast_buffer.write(data, size);

#ifdef WRITE_RAW_MJPEG_STREAM 
#else
    if ( ok && addFrameStartPattern ) 
    {
        ok = s_sd_fast_buffer.writeBytes(0, MJPEG_PATTERN_SIZE);
    }
#endif

#ifdef PROFILE_CAMERA_DATA
    s_profiler.set(PF_CAMERA_SD_FAST_BUF, s_sd_fast_buffer.size() / (SD_FAST_BUFFER_SIZE / 100) );
#endif

    xSemaphoreGive(s_sd_fast_buffer_mux);
    if (ok)
    {
        if (s_sd_enqueue_task)
            xTaskNotifyGive(s_sd_enqueue_task); //notify task
    }
    else
    {
        s_stats.sd_drops += size;
#ifdef PROFILE_CAMERA_DATA
        s_profiler.toggle(PF_CAMERA_SD_OVF);
#endif
    }
}

#endif

//=============================================================================================
//=============================================================================================
// Filters one received transport packet and feeds it into the FEC decoder.
IRAM_ATTR void transport_packet_received_cb(const uint8_t* data, size_t size, int8_t rssi_dbm, int8_t noise_floor_dbm)
{
    auto res = s_fec_decoder.packetFilter.filter_packet(data, size, GROUND2AIR_MAX_MTU);
    if ( res != PacketFilter::PacketFilterResult::Pass)
    {
        s_stats.inRejectedPacketCounter++;
        return;
    }

