RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    s_stats.inPacketCounter++;
    s_stats.rssiDbm = rssi_dbm;
    s_stats.noiseFloorDbm = noise_floor_dbm;

#ifdef UART_MAVLINK
    // Wi-Fi supplies the magnitude of the negative dBm value here.
    const int rssiMagnitudeDbm = std::clamp(static_cast<int>(rssi_dbm), 0, 127);
    s_mavlink_radio_status_rssi_dbm_magnitude = static_cast<uint8_t>(rssiMagnitudeDbm);
    s_mavlink_radio_status_link_quality = static_cast<uint8_t>(
        std::clamp(100 - rssiMagnitudeDbm, 0, 100));
#endif

#ifdef UART_MSP_OSD
    g_msp.setRadioRssi(rssi_dbm);
#endif

    s_fec_decoder.lock();
    if (!s_fec_decoder.decode_data(data, size, false))
    {
        s_stats.wlan_received_packets_dropped++;
    }
    s_fec_decoder.unlock();

    s_stats.wlan_data_received += size;
}

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR bool processSetting(const char* valueName, int fromValue, int toValue, const char *nvsName )
{
    if ( fromValue != toValue )
    {
        LOG("%s changed from %d to %d\n", valueName, fromValue, toValue );
        if ( !!nvsName ) 
        {
            nvs_args_set(nvsName, (uint32_t)toValue);
        }
        return true;
    }
    return false;
}

//=============================================================================================
//=============================================================================================
//process settings not related to camera sensor setup
static void handle_ground2air_config_packetEx1(Ground2Air_Config_Packet& src)
{
    int64_t t = esp_timer_get_time();
    s_last_seen_config_packet = t;

    Ground2Air_Config_Packet& dst = s_ground2air_config_packet;

#if CONFIG_IDF_TARGET_ESP32C5
    // ESP32-C5 cannot perform the active radar detection required for a DFS SoftAP.
    // Sanitize before processSetting() persists the requested channel to NVS.
    if (src.misc.apfpv != 0 && !isWifiChannelSupportedForApfpv(src.dataChannel.wifi_channel))
    {
        LOG("APFPV channel %d requires DFS; using safe default channel %d\n",
            src.dataChannel.wifi_channel,
            DEFAULT_WIFI_CHANNEL_5_8_GHZ);
        src.dataChannel.wifi_channel = DEFAULT_WIFI_CHANNEL_5_8_GHZ;
    }
#endif

    bool transport_changed = processSetting( "apfpv",  dst.misc.apfpv, src.misc.apfpv, "apfpv" );
    if (transport_changed)
    {
        // Transport mode changes are applied after reboot so the full radio stack
        // comes up cleanly in the new mode instead of trying to hot-switch in place.
        if (s_restart_time == 0)
        {
            s_restart_time = esp_timer_get_time() + 1000; //1 ms
        }
    }

    if ( processSetting( "Wifi rate", (int)dst.dataChannel.wifi_rate, (int)src.dataChannel.wifi_rate, "rate") )
    {
        ESP_ERROR_CHECK(set_wifi_fixed_rate(src.dataChannel.wifi_rate));
    }
    
    if ( processSetting( "Wifi power", dst.dataChannel.wifi_power, src.dataChannel.wifi_power, NULL ) )
    {
        ESP_ERROR_CHECK(set_wlan_power_dBm(src.dataChannel.wifi_power));
    }

    if ( processSetting( "FEC codec N", dst.dataChannel.fec_codec_n, src.dataChannel.fec_codec_n, "fec_n") )
    {
        s_fec_encoder.switch_n( src.dataChannel.fec_codec_n );
    }
    
    if ( processSetting( "Wifi channel", dst.dataChannel.wifi_channel, src.dataChannel.wifi_channel, "channel" ) )
    {
        int channel = getValidWifiChannel(src.dataChannel.wifi_channel);
        LOG("Validated Wifi channel: %d\n", channel );

        // APFPV mode must rebuild the AP on the new channel so GS can reassociate to the moved SSID.
        if (src.misc.apfpv != 0)
        {
#if CONFIG_IDF_TARGET_ESP32C5
            // Rebuilding the active C5 SoftAP while camera DMA and UDP tasks are running can
            // abort inside the Wi-Fi driver. The channel is already persisted above, so use a
            // deliberate reboot and let startup construct the radio stack on the new channel.
            LOG("APFPV channel %d saved; intentionally rebooting to apply it\n", channel);
            if (s_restart_time == 0)
            {
                s_restart_time = esp_timer_get_time() + 100000; // 100 ms
            }
#else
            LOG("APFPV applying channel change: requested=%d validated=%d rate=%d power=%d\n",
                src.dataChannel.wifi_channel,
                channel,
                (int)src.dataChannel.wifi_rate,
                (int)src.dataChannel.wifi_power);
            ESP_ERROR_CHECK(switch_wifi_transport(true,
                                                 src.dataChannel.wifi_rate,
                                                 channel,
                                                 src.dataChannel.wifi_power));
#endif
        }
        else
        {
            ESP_ERROR_CHECK(set_wifi_channel(channel));
        }
    }

    s_video_target_frame_dt = 0;
/*
    if ( processSetting( "Target FPS", dst.camera.fps_limit, src.camera.fps_limit, NULL) )
    {
        if (src.camera.fps_limit == 0)
            s_video_target_frame_dt = 0;
        else
            s_video_target_frame_dt = 1000000 / src.camera.fps_limit;
    }
*/
    processSetting( "AutostartRecord", dst.misc.autostartRecord, src.misc.autostartRecord, "autostartRecord" );

    processSetting( "CameraStopChannel", dst.misc.cameraStopChannel, src.misc.cameraStopChannel, "cameraStopCH" );

    if (src.misc.stabilizationChannel > 18)
    {
        src.misc.stabilizationChannel = 0;
    }
    processSetting("StabilizationChannel",
                   dst.misc.stabilizationChannel,
                   src.misc.stabilizationChannel,
                   "stabilizationCH");

    if (src.misc.mavlinkBaudrate > 5)
    {
        src.misc.mavlinkBaudrate = 0;
    }
    if (processSetting("MavlinkBaudrate",
                       dst.misc.mavlinkBaudrate,
                       src.misc.mavlinkBaudrate,
                       nullptr))
    {
        const uint32_t baudrate = getMavlinkBaudrateFromSetting(src.misc.mavlinkBaudrate);
        xSemaphoreTake(s_serial_mux, portMAX_DELAY);
#ifdef UART_MAVLINK
        ESP_ERROR_CHECK(uart_set_baudrate(UART_MAVLINK, baudrate));
#endif
        s_mavlink_baudrate = baudrate;
        xSemaphoreGive(s_serial_mux);
        nvs_args_set(NVS_KEY_MAVLINK_BAUDRATE, baudrate);
    }

