RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    processSetting("MavlinkInjectRadioStatus",
                   dst.misc.mavlinkInjectRadioStatus,
                   src.misc.mavlinkInjectRadioStatus,
                   "mavInjectStat");
    processSetting("MavlinkInjectRssiCh16",
                   dst.misc.mavlinkInjectRssiCh16,
                   src.misc.mavlinkInjectRssiCh16,
                   "mavRssiCh16");
    src.misc.reserved = 0;

    processSetting( "mavlink2mspRC",  dst.misc.mavlink2mspRC, src.misc.mavlink2mspRC, "mavlink2mspRC" );

    processSetting( "osdFontCRC32",  dst.misc.osdFontCRC32, src.misc.osdFontCRC32, "osdFontCRC32" );

    if (memcmp(&dst.camera.lens_correction,
               &src.camera.lens_correction,
               sizeof(src.camera.lens_correction)) != 0)
    {
        LOG("Lens correction settings changed\n");
        ESP_ERROR_CHECK(nvs_args_set_blob("lens_corr",
                                          &src.camera.lens_correction,
                                          sizeof(src.camera.lens_correction)));
    }

    if ( s_restart_time == 0 )
    {
        if ( dst.misc.air_record_btn != src.misc.air_record_btn )
        {
            s_air_record = !s_air_record;
            //dst.misc.air_record_btn = src.misc.air_record_btn;
        }

#if defined(ENABLE_PROFILER)
        if ( dst.misc.profile1_btn != src.misc.profile1_btn )
        {
            if ( s_profiler.isActive())
            {
                LOG("Profiler stopped!\n");
                s_profiler.stop();
                s_profiler.save();
                s_profiler.clear();
            }
            else
            {
                LOG("Profiler started!\n");
                s_profiler.start(500);
            }
            dst.misc.profile1_btn = src.misc.profile1_btn;
        }

        if ( dst.misc.profile2_btn != src.misc.profile2_btn )
        {
            if ( s_profiler.isActive())
            {
                LOG("Profiler stopped!\n");
                s_profiler.stop();
                s_profiler.save();
                s_profiler.clear();
            }
            else
            {
                LOG("Profiler started!\n");
                s_profiler.start(3000);
            }
            dst.misc.profile2_btn = src.misc.profile2_btn;
        }
#endif
    }

    dst = src;
}

//=============================================================================================
//=============================================================================================
//process settings related to camera sensor setup
void handle_ground2air_config_packetEx2(bool forceCameraSettings)
{
    Ground2Air_Config_Packet& src = s_ground2air_config_packet;
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet2;

#ifdef USE_MOCK_CAMERA
    sensor_t* s = mock_camera_sensor_get();
#else
    sensor_t* s = esp_camera_sensor_get();
#endif

    if (camera_uses_ov5640_mode_table())
    {
        // On OV5640-family sensors, AEC2 is a night mode that dynamically reduces frame rate.
        src.camera.aec2 = false;
    }

    bool resolutionChanged = (dst.camera.resolution != src.camera.resolution);
    bool ov2640HighFPSChanged = (src.camera.ov2640HighFPS != dst.camera.ov2640HighFPS );
    bool ov3660HighFPSChanged = (src.camera.ov3660HighFPS != dst.camera.ov3660HighFPS );
    bool ov5640HighFPSChanged = (src.camera.ov5640HighFPS != dst.camera.ov5640HighFPS );
    if ( forceCameraSettings || resolutionChanged || ov2640HighFPSChanged || ov3660HighFPSChanged || ov5640HighFPSChanged )
    {
        s_shouldRestartRecording =  esp_timer_get_time() + 1000000;
        LOG("Camera resolution changed from %d to %d\n", (int)dst.camera.resolution, (int)src.camera.resolution);

        if (camera_uses_ov5640_mode_table())
        {
            bool highFPS = camera_is_ov5640()
                ? src.camera.ov5640HighFPS
                : src.camera.ov3660HighFPS;
            s->set_colorbar(s, highFPS ? 1 : 0);
        }
        else
        {
            if ( src.camera.ov2640HighFPS &&
                ((src.camera.resolution == Resolution::VGA) ||
                (src.camera.resolution == Resolution::VGA16) ||
                (src.camera.resolution == Resolution::SVGA16))
                )
            {
                s->set_xclk( s, LEDC_TIMER_0, 16 );
            }
            else
            {
                s->set_xclk( s, LEDC_TIMER_0, 12 );
            }
        }

        switch (src.camera.resolution)
        {
            case Resolution::QVGA: s->set_framesize(s, FRAMESIZE_QVGA); break;
            case Resolution::CIF: s->set_framesize(s, FRAMESIZE_CIF); break;
            case Resolution::HVGA: s->set_framesize(s, FRAMESIZE_HVGA); break;
            case Resolution::VGA: s->set_framesize(s, FRAMESIZE_VGA); break;

            case Resolution::VGA16:
                if (camera_uses_ov5640_mode_table())
                {
                    s->set_framesize(s, FRAMESIZE_P_3MP); //640x360
                }
                else
                {
                    s->set_res_raw(s, 1/*OV2640_MODE_SVGA*/,0,0,0, 0, 72, 800, 600-144, 640,360,false,false);   //800x456 window scaled by DSP to 640x360, 30 fps
                }
            break;

            case Resolution::SVGA: s->set_framesize(s, FRAMESIZE_SVGA); break;

            case Resolution::SVGA16:
                if (camera_uses_ov5640_mode_table())
                {
                    // Warning: verbose logging in ov5640.c can overflow the camera task stack.
                    s->set_framesize(s, FRAMESIZE_P_HD); //800x456
                }
                else
                {
                    //s->set_framesize(s, FRAMESIZE_P_HD);  800x448 13 fps
                    s->set_res_raw(s, 1/*OV2640_MODE_SVGA*/,0,0,0, 0, 72, 800, 600-144, 800,600-144,false,false);   //800x456 13 fps
                }
            break;

            case Resolution::XGA: s->set_framesize(s, FRAMESIZE_XGA); break; //1024x768

            case Resolution::XGA16:  //1024x576
                if (camera_uses_ov5640_mode_table())
                {
                    s->set_framesize(s, FRAMESIZE_P_FHD);
                }
                else
                {
                    s->set_res_raw(s, 0/*OV2640_MODE_UXGA*/,0,0,0, 0, 150, 1600, 1200-300, 1024, 576, false, false);   //1024x576 13 fps
                }
            break;
            case Resolution::SXGA: s->set_framesize(s, FRAMESIZE_SXGA); break;
            case Resolution::HD: s->set_framesize(s, FRAMESIZE_HD); break;
            case Resolution::UXGA: s->set_framesize(s, FRAMESIZE_UXGA); break;

