RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
            case Resolution::COUNT:
            break;

        }

        if ( resolutionChanged)
        {
            nvs_args_set("resolution", (uint32_t)src.camera.resolution);
        }
        if ( ov2640HighFPSChanged)
        {
            nvs_args_set( "ov2640hfps", src.camera.ov2640HighFPS?1:0 );
        }
        if ( ov3660HighFPSChanged)
        {
            nvs_args_set( "ov3660hfps", src.camera.ov3660HighFPS?1:0 );
        }
        if ( ov5640HighFPSChanged)
        {
            nvs_args_set( "ov5640hfps", src.camera.ov5640HighFPS?1:0 );
        }
    }

#define APPLY(n1, n2, type) \
    if (forceCameraSettings || (dst.camera.n1 != src.camera.n1)) \
    { \
        LOG("Camera " #n1 " from %d to %d\n", (int)dst.camera.n1, (int)src.camera.n1); \
        s->set_##n2(s, (type)src.camera.n1); \
    }

#define SAVE(n) \
    if (dst.camera.n != src.camera.n) \
    { \
        nvs_args_set(#n, (uint32_t)src.camera.n); \
    }

    if ( src.camera.quality != 0 )
    {
        APPLY(quality, quality, int);
        s_quality = src.camera.quality;
    }
    else
    {
        if ( forceCameraSettings )
        {
            s->set_quality(s, 20); 
        }
    }

    if ( dst.camera.agc != src.camera.agc)
    {
        //reapply agc gain if agc changed
        forceCameraSettings = true;
    }

    if ( dst.camera.aec != src.camera.aec)
    {
        //reapply aec value if aec changed
        forceCameraSettings = true;
    }

    SAVE(brightness)
    APPLY(brightness, brightness, int)

    SAVE(contrast)
    APPLY(contrast, contrast, int)

    SAVE(saturation)
    APPLY(saturation, saturation, int)

    SAVE(sharpness)
    if ( s_quality < 50 )
    {
        APPLY(sharpness, sharpness, int);
        s_sharpness = src.camera.sharpness;
    }
    APPLY(denoise, denoise, int);

    if (camera_uses_ov5640_mode_table())
    {
        // OV5640-family gain ceiling is 0...0x3ff and high values do not cause the severe
        // low-light noise seen on OV2640, so leave its full gain range available.
        if (forceCameraSettings || (dst.camera.gainceiling != src.camera.gainceiling))
        {
            LOG("Camera gainceiling from %d to %d\n", (int)dst.camera.gainceiling, (int)src.camera.gainceiling);
            s->set_gainceiling(s, (gainceiling_t)(0x3ff));
        }
    }
    else
    {
        APPLY(gainceiling, gainceiling, gainceiling_t);
    }

    APPLY(awb, whitebal, int);
    APPLY(awb_gain, awb_gain, int);
    APPLY(wb_mode, wb_mode, int);
    APPLY(agc, gain_ctrl, int);
    APPLY(agc_gain, agc_gain, int);
    APPLY(aec, exposure_ctrl, int);
    APPLY(aec_value, aec_value, int);
    APPLY(aec2, aec2, int);

    SAVE(ae_level);
    APPLY(ae_level, ae_level, int);

    APPLY(hmirror, hmirror, int);
    
    if ( dst.camera.vflip != src.camera.vflip )
    {
        nvs_args_set( "vflip", src.camera.vflip?1:0 );
    }
    APPLY(vflip, vflip, int);

    APPLY(special_effect, special_effect, int);
    APPLY(dcw, dcw, int);
    APPLY(bpc, bpc, int);
    APPLY(wpc, wpc, int);
    APPLY(raw_gma, raw_gma, int);
    APPLY(lenc, lenc, int);
#undef APPLY
#undef SAVE
    dst = src;
}

//===========================================================================================
//===========================================================================================
// Permanently associates this camera with one GS for the current boot.
__attribute__((optimize("Os")))
IRAM_ATTR static void acceptConnectionWithGS( uint16_t gsDeviceId )
{
    s_connected_gs_device_id = gsDeviceId;
    s_fec_encoder.packetFilter.set_packet_header_data( s_air_device_id, s_connected_gs_device_id );
    s_fec_decoder.packetFilter.set_packet_filtering( s_connected_gs_device_id, s_air_device_id );

    LOG("Accepting connection to GS device ID: 0x%04x\n", s_connected_gs_device_id );
}

//===========================================================================================
//===========================================================================================
// Accepts configuration only from the GS associated with this camera.
static void handle_ground2air_config_packet(Ground2Air_Config_Packet& src)
{
    // The decoder filter rejects new packets from other devices after association,
    // while this check also rejects packets already queued before the filter changed.
    if ( src.gsDeviceId == 0 || src.airDeviceId != s_air_device_id ||
         ( s_connected_gs_device_id != 0 && src.gsDeviceId != s_connected_gs_device_id ) )
    {
        return;
    }

    if ( s_connected_gs_device_id == 0 ) 
    {
        // Accept the first GS addressing this camera and keep that association until reboot.
        acceptConnectionWithGS( src.gsDeviceId );
    }

    //handle settings not related to camera sensor setup.
    //camera sensor settings are processed in camera_data_available() callback
    handle_ground2air_config_packetEx1(src);
}

//===========================================================================================
//===========================================================================================
// Associates the first valid GS and ignores later connection requests until reboot.
IRAM_ATTR static void handle_ground2air_connect_packet(Ground2Air_Config_Packet& src)
{
    if ( src.gsDeviceId != 0 && s_connected_gs_device_id == 0 )
    {
        // Connect is broadcast during search; the first valid GS owns the camera until reboot.
        acceptConnectionWithGS( src.gsDeviceId );
    }
}

static void init_camera();

#ifdef UART_MAVLINK
//===================================================================================
//===================================================================================
// Writes one RADIO_STATUS frame and schedules the next event after a successful send.
static bool send_mavlink_radio_status(size_t uart_free_size)
{
    uint8_t frame[MAVLINK_RADIO_STATUS_FRAME_SIZE];
    const uint32_t now = millis();
    const bool rcLinkActive = s_mavlink_rc_received &&
        now - s_mavlink_last_rc_received_ms <= MAVLINK_RC_LINK_TIMEOUT_MS;
    const uint8_t txBuffer = static_cast<uint8_t>(
        std::min<size_t>(100, uart_free_size * 100 / UART_TX_BUFFER_SIZE_MAVLINK));

    // INAV 9 ELRS mode reads RSSI dBm magnitude from remrssi and scales rssi
    // from 0..255 to link quality 0..100. Rounding up preserves the requested
    // 100 + dBm percentage after INAV's integer down-scaling. Report -100 dBm
    // and zero LQ after one second without a real MAVLink RC packet.
    const uint8_t linkQuality = rcLinkActive ? s_mavlink_radio_status_link_quality : 0;
    const uint8_t rssiDbmMagnitude = rcLinkActive ?
        s_mavlink_radio_status_rssi_dbm_magnitude : 100;
    const uint8_t encodedLinkQuality = static_cast<uint8_t>(
        std::min<int>(UINT8_MAX,
            (linkQuality * UINT8_MAX + 99) / 100));
    const size_t frameSize = HXMavlinkRCEncoder::buildRadioStatus(
        frame,
        sizeof(frame),
        s_mavlink_radio_status_sequence,
        encodedLinkQuality,
        txBuffer,
        rssiDbmMagnitude,
        0);

    if (frameSize == 0 || uart_write_bytes(UART_MAVLINK, frame, frameSize) != frameSize)
    {
        return false;
    }

