RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    s_mavlink_radio_status_sequence++;
    s_mavlink_radio_status_next_send_ms = millis() + MAVLINK_RADIO_STATUS_INTERVAL_MS;
    return true;
}

//===================================================================================
//===================================================================================
// Sends a due RADIO_STATUS after input silence when injection is enabled and MAVLink is forwarded unchanged.
static void send_mavlink_radio_status_if_idle()
{
    uint32_t now = millis();
    if (s_ground2air_config_packet2.misc.mavlinkInjectRadioStatus == 0 ||
        s_ground2air_config_packet2.misc.mavlink2mspRC != 0 ||
        static_cast<int32_t>(now - s_mavlink_radio_status_next_send_ms) < 0 ||
        now - s_mavlink_last_input_ms < MAVLINK_RADIO_STATUS_IDLE_MS)
    {
        return;
    }

    xSemaphoreTake(s_serial_mux, portMAX_DELAY);

    // Input processing uses the same mutex and may have sent the pending status
    // while this task was waiting, so recheck both deadlines under the lock.
    now = millis();
    if (s_ground2air_config_packet2.misc.mavlinkInjectRadioStatus != 0 &&
        s_ground2air_config_packet2.misc.mavlink2mspRC == 0 &&
        static_cast<int32_t>(now - s_mavlink_radio_status_next_send_ms) >= 0 &&
        now - s_mavlink_last_input_ms >= MAVLINK_RADIO_STATUS_IDLE_MS)
    {
        size_t free_size = 0;
        ESP_ERROR_CHECK(uart_get_tx_buffer_free_size(UART_MAVLINK, &free_size));
        if (free_size >= MAVLINK_RADIO_STATUS_FRAME_SIZE)
        {
            send_mavlink_radio_status(free_size);
        }
    }

    xSemaphoreGive(s_serial_mux);
}
#endif

//===========================================================================================
//===========================================================================================
// Parses ground-to-air MAVLink for local RC actions and forwards it to UART when available.
__attribute__((optimize("Os")))
IRAM_ATTR static void handle_ground2air_data_packet(Ground2Air_Data_Packet& src)
{
    if ( ( s_connected_gs_device_id == 0 ) ||
         ( src.gsDeviceId != s_connected_gs_device_id ) ||
         ( src.airDeviceId != s_air_device_id ) ) return;

    xSemaphoreTake(s_serial_mux, portMAX_DELAY);

    int s = src.size - sizeof(Ground2Air_Header);
    s_stats.in_telemetry_data += s;
#ifdef UART_MAVLINK
    s_mavlink_last_input_ms = millis();
#endif
    const bool mavlink2MspRcEnabled = s_ground2air_config_packet2.misc.mavlink2mspRC != 0;

    uint8_t* dPtr = ((uint8_t*)&src) + sizeof(Ground2Air_Header);
#ifdef UART_MAVLINK
    int radio_status_insert_offset = -1;
    int rc_packet_count = 0;
    const bool radio_status_due =
        s_ground2air_config_packet2.misc.mavlinkInjectRadioStatus != 0 &&
        !mavlink2MspRcEnabled &&
        static_cast<int32_t>(s_mavlink_last_input_ms - s_mavlink_radio_status_next_send_ms) >= 0;
#endif
    for ( int i = 0; i < s; i++ )
    {
        mavlinkParserIn.processByte(*dPtr++);
        if ( mavlinkParserIn.gotPacket())
        {
#ifdef UART_MAVLINK
            if ( radio_status_due && radio_status_insert_offset < 0 )
            {
                radio_status_insert_offset = i + 1;
            }
#endif

            if ( mavlinkParserIn.getMessageId() == HX_MAXLINK_RC_CHANNELS_OVERRIDE )
            {
#ifdef UART_MAVLINK
                rc_packet_count++;
                s_mavlink_last_rc_received_ms = s_mavlink_last_input_ms;
                s_mavlink_rc_received = true;

                if (s_ground2air_config_packet2.misc.mavlinkInjectRssiCh16 != 0)
                {
                    const uint16_t rssiChannelValue = static_cast<uint16_t>(
                        1000 + static_cast<uint16_t>(s_mavlink_radio_status_link_quality) * 10);
                    const int mavlinkPacketLength = mavlinkParserIn.getPacketLength();
                    const int mavlinkPacketOffset = i + 1 - mavlinkPacketLength;
                    if (mavlinkPacketOffset >= 0 &&
                        mavlinkParserIn.setRCChannelValue(16, rssiChannelValue))
                    {
                        memcpy(((uint8_t*)&src) + sizeof(Ground2Air_Header) + mavlinkPacketOffset,
                               mavlinkParserIn.getPacketBuffer(),
                               mavlinkPacketLength);
                    }
                }
#endif

#ifdef UART_MSP_OSD
                if (mavlink2MspRcEnabled)
                {
                    const HXMAVLinkRCChannelsOverride* msg = mavlinkParserIn.getMsg<HXMAVLinkRCChannelsOverride>();
                    //LOG("%d %d %d %d\n", msg->chan1_raw, msg->chan2_raw, msg->chan3_raw, msg->chan4_raw);
                    uint16_t ch[MSP_RC_CHANNELS_COUNT];
                    for ( int i = 0; i < MSP_RC_CHANNELS_COUNT; i++ )
                    {
                        ch[i] = msg->getChannelValue( i + 1 );
                    }
                    g_msp.setRCChannels(ch);
                }
#endif                

                if ( s_ground2air_config_packet2.misc.cameraStopChannel != 0 )
                {
                    const HXMAVLinkRCChannelsOverride* msg = mavlinkParserIn.getMsg<HXMAVLinkRCChannelsOverride>();
                    s_camera_stopped_requested = msg->getChannelValue( s_ground2air_config_packet2.misc.cameraStopChannel ) > 1700;

                    //LOG("%d %d %d %d\n", msg->chan1_raw, msg->chan2_raw, msg->chan3_raw, msg->chan4_raw);
                    //LOG("%d %d %d %d %d\n", msg->chan9_raw, msg->chan10_raw, msg->chan11_raw, msg->chan12_raw, mavlinkParserIn.getPacketLength());
                }
                else
                {
                    s_camera_stopped_requested = false;
                }
            }
        }
    }

#ifdef UART_MAVLINK
    size_t freeSize = 0;
    ESP_ERROR_CHECK( uart_get_tx_buffer_free_size(UART_MAVLINK, &freeSize) );

    uint8_t* payload = ((uint8_t*)&src) + sizeof(Ground2Air_Header);
    bool mavlink_payload_queued = false;
    if ( radio_status_insert_offset >= 0 && freeSize >= s + MAVLINK_RADIO_STATUS_FRAME_SIZE )
    {
        const int first_part_written = uart_write_bytes(UART_MAVLINK, payload, radio_status_insert_offset);
        send_mavlink_radio_status(freeSize - s);
        const int second_part_size = s - radio_status_insert_offset;
        const int second_part_written = uart_write_bytes(UART_MAVLINK,
            payload + radio_status_insert_offset,
            second_part_size);
        mavlink_payload_queued = first_part_written == radio_status_insert_offset &&
            second_part_written == second_part_size;
    }
    else if ( freeSize >= s )
    {
        mavlink_payload_queued = uart_write_bytes(UART_MAVLINK, payload, s) == s;
    }

