RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                if (ulStatsAsPercentage > 0UL)
                {
                    LOG("%s\t\t%u\t\t%u%%\r\n", pxTaskStatusArray[x].pcTaskName, pxTaskStatusArray[x].ulRunTimeCounter, ulStatsAsPercentage);
                }
                else
                {
                    // If the percentage is zero here then the task has
                    // consumed less than 1% of the total run time.
                    LOG("%s\t\t%u\t\t<1%%\r\n", pxTaskStatusArray[x].pcTaskName, pxTaskStatusArray[x].ulRunTimeCounter);
                }
            }
        }

        // The array is no longer needed, free the memory it consumes.
        free(pxTaskStatusArray);
    }
#endif
}

//=============================================================================================
//=============================================================================================
uint16_t generateDeviceId() 
{
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA); // Read base MAC address
    uint16_t id = 0;

    // Fold MAC address into 16 bits
    id ^= (mac[0] << 8) | mac[1];
    id ^= (mac[2] << 8) | mac[3];
    id ^= (mac[4] << 8) | mac[5];

    return id;
}
//=============================================================================================
//=============================================================================================
void readConfig()
{
    s_air_device_id = (uint16_t)nvs_args_read( "deviceId", 0 );
    if( s_air_device_id == 0 )
    {
        s_air_device_id = generateDeviceId();
        nvs_args_set("deviceId", s_air_device_id);
    }
    LOG("Air Device ID: 0x%04x\n", (int)s_air_device_id);

#ifdef BOARD_ESP32C5
    constexpr uint16_t default_wifi_channel = DEFAULT_WIFI_CHANNEL_5_8_GHZ;
#else
    constexpr uint16_t default_wifi_channel = DEFAULT_WIFI_CHANNEL_2_4GHZ;
#endif
    s_ground2air_config_packet.dataChannel.wifi_channel = (uint16_t)nvs_args_read("channel", default_wifi_channel);
    if  ( (s_ground2air_config_packet.dataChannel.wifi_channel < MIN_WIFI_CHANNEL) || (s_ground2air_config_packet.dataChannel.wifi_channel >= MAX_WIFI_CHANNEL))
    {
        s_ground2air_config_packet.dataChannel.wifi_channel = default_wifi_channel;
        nvs_args_set("channel", s_ground2air_config_packet.dataChannel.wifi_channel);
    }

    s_ground2air_config_packet.dataChannel.wifi_rate = (WIFI_Rate)nvs_args_read( "rate", -1 );
    if( s_ground2air_config_packet.dataChannel.wifi_rate > WIFI_Rate::RATE_N_72M_MCS7_S )
    {
        s_ground2air_config_packet.dataChannel.wifi_rate = DEFAULT_WIFI_RATE;
        nvs_args_set("rate", (uint32_t)s_ground2air_config_packet.dataChannel.wifi_rate);
    }

    s_ground2air_config_packet.dataChannel.fec_codec_k = (uint8_t)nvs_args_read( "fec_k", 0 );
    s_ground2air_config_packet.dataChannel.fec_codec_n = (uint8_t)nvs_args_read( "fec_n", 0 );

    if( 
        (s_ground2air_config_packet.dataChannel.fec_codec_k == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k > 12) || 
        (s_ground2air_config_packet.dataChannel.fec_codec_n == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_n > 12) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k >= s_ground2air_config_packet.dataChannel.fec_codec_n) 
        )
    {
        s_ground2air_config_packet.dataChannel.fec_codec_k = 6;
        s_ground2air_config_packet.dataChannel.fec_codec_n = 8;
        nvs_args_set("fec_k", s_ground2air_config_packet.dataChannel.fec_codec_k);
        nvs_args_set("fec_n", s_ground2air_config_packet.dataChannel.fec_codec_n);
    }

    s_ground2air_config_packet.camera.resolution = (Resolution)nvs_args_read("resolution", (uint32_t)Resolution::SVGA);
    if ( s_ground2air_config_packet.camera.resolution > Resolution::HD  )
    {
        s_ground2air_config_packet.camera.resolution = Resolution::SVGA;
        nvs_args_set("resolution", (uint32_t)s_ground2air_config_packet.camera.resolution);
    }

    s_ground2air_config_packet.camera.brightness = (int8_t)nvs_args_read("brightness", 10);
    if ( ( s_ground2air_config_packet.camera.brightness < -2 ) || ( s_ground2air_config_packet.camera.brightness > 2 ) )
    {
        s_ground2air_config_packet.camera.brightness = 0;
        nvs_args_set("brightness", s_ground2air_config_packet.camera.brightness);
    }

    s_ground2air_config_packet.camera.contrast = (int8_t)nvs_args_read("contrast", 10);
    if ((s_ground2air_config_packet.camera.contrast < -2) || (s_ground2air_config_packet.camera.contrast > 2))
    {
        s_ground2air_config_packet.camera.contrast = 0; // Default contrast
        nvs_args_set("contrast", s_ground2air_config_packet.camera.contrast);
    }

    s_ground2air_config_packet.camera.saturation = (int8_t)nvs_args_read("saturation", 10);
    if ((s_ground2air_config_packet.camera.saturation < -2) || (s_ground2air_config_packet.camera.saturation > 2))
    {
        s_ground2air_config_packet.camera.saturation = 1; // Default saturation
        nvs_args_set("saturation", s_ground2air_config_packet.camera.saturation);
    }

    s_ground2air_config_packet.camera.sharpness = (int8_t)nvs_args_read("sharpness", 10);
    if ((s_ground2air_config_packet.camera.sharpness < -2) || (s_ground2air_config_packet.camera.sharpness > 3))
    {
        s_ground2air_config_packet.camera.sharpness = 0; // Default sharpness
        nvs_args_set("sharpness", s_ground2air_config_packet.camera.sharpness);
    }

    s_ground2air_config_packet.camera.ae_level = (int8_t)nvs_args_read("ae_level", 10);
    if ((s_ground2air_config_packet.camera.ae_level < -2) || (s_ground2air_config_packet.camera.ae_level > 2))
    {
        s_ground2air_config_packet.camera.ae_level = 1; // Default ae_level
        nvs_args_set("ae_level", s_ground2air_config_packet.camera.ae_level);
    }

    s_ground2air_config_packet.camera.vflip = nvs_args_read( "vflip", 0 ) == 1;
    s_ground2air_config_packet.camera.ov2640HighFPS = nvs_args_read( "ov2640hfps", 0 ) == 1;
    s_ground2air_config_packet.camera.ov3660HighFPS = nvs_args_read( "ov3660hfps", 0 ) == 1;
    s_ground2air_config_packet.camera.ov5640HighFPS = nvs_args_read( "ov5640hfps", 0 ) == 1;

    LensCorrectionConfig lens_correction;
    if (nvs_args_read_blob("lens_corr", &lens_correction, sizeof(lens_correction)) == ESP_OK)
    {
        s_ground2air_config_packet.camera.lens_correction = lens_correction;
    }

    s_ground2air_config_packet.misc.autostartRecord = nvs_args_read( "autostartRecord", 1 );
    uint32_t mavlink_baudrate = nvs_args_read( NVS_KEY_MAVLINK_BAUDRATE, DEFAULT_MAVLINK_BAUDRATE );
    s_mavlink_baudrate = getValidMavlinkBaudrate(mavlink_baudrate);
    if ( mavlink_baudrate != s_mavlink_baudrate )
    {
        nvs_args_set(NVS_KEY_MAVLINK_BAUDRATE, s_mavlink_baudrate);
    }

    s_ground2air_config_packet.misc.cameraStopChannel = nvs_args_read( "cameraStopCH", 0 );
    if ( s_ground2air_config_packet.misc.cameraStopChannel > 18 )
    {
        s_ground2air_config_packet.misc.cameraStopChannel = 0;
    }

