RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    //reinitialize rec button after configuring uarts
#ifdef REC_BUTTON_PIN    
    initialize_rec_button();
#endif
    nvs_args_init();

    readConfig();

    s_air_record = s_ground2air_config_packet2.misc.autostartRecord != 0;

    bool runFileServer = false;

#ifdef DVR_SUPPORT
    runFileServer = getButtonState();
#endif

    if ( !runFileServer )
    {
        // Allocate the normal transport only when this boot will use it. File-server
        // mode starts its own SoftAP and must not inherit an APFPV band or channel.
        int channel = getValidWifiChannel(s_ground2air_config_packet.dataChannel.wifi_channel);
        setup_wifi(s_ground2air_config_packet.dataChannel.wifi_rate,
                   channel,
                   s_ground2air_config_packet.dataChannel.wifi_power,
                   s_air_device_id,
                   s_ground2air_config_packet.misc.apfpv != 0,
                   transport_packet_received_cb);
        s_fec_encoder.packetFilter.set_packet_header_data(s_air_device_id, 0);

        //allocates 16kb dma buffer. Allocate ASAP before memory is fragmented.
#ifdef USE_MOCK_CAMERA
        init_mock_camera();
#else
        printf("MEMORY Before init_camera: \n");
        heap_caps_print_heap_info(MALLOC_CAP_8BIT);
        heap_caps_print_heap_info(MALLOC_CAP_DMA);

        init_camera();

        printf("MEMORY After init_camera: \n");
        heap_caps_print_heap_info(MALLOC_CAP_8BIT);
        heap_caps_print_heap_info(MALLOC_CAP_DMA);
#endif
    }

#ifdef DVR_SUPPORT

#ifdef WRITE_RAW_MJPEG_STREAM 
#else
    prepAviBuffers();
#endif    

    xSemaphoreGive(s_sd_fast_buffer_mux);
    xSemaphoreGive(s_sd_slow_buffer_mux);

    printf("MEMORY Before Init_SD: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);
    heap_caps_print_heap_info(MALLOC_CAP_DMA);

    init_sd();

    printf("MEMORY After Init_SD: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);
    heap_caps_print_heap_info(MALLOC_CAP_DMA);

    vTaskDelay(100 / portTICK_PERIOD_MS);

    //run file server if rec button is pressed on startup
    if ( runFileServer )
    {
        //============================================================================
        LOG("Starting file server...");

        // The normal Wi-Fi transport was intentionally never initialized on this boot.
        // Release only recorder buffers before starting the independent file-server AP.
        free(sd_write_block);
        heap_caps_free( s_sd_slow_buffer->getBufferPtr() );

        printf("MEMORY Before setup_wifi_file_server(): \n");
        //heap_caps_print_heap_info(MALLOC_CAP_8BIT);
        //heap_caps_print_heap_info(MALLOC_CAP_EXEC);
        heap_caps_print_heap_info(MALLOC_CAP_SPIRAM);
        heap_caps_print_heap_info(MALLOC_CAP_DMA);

        setup_wifi_file_server();

#if defined(USB_DISK_SUPPORT)
        if (s_sd_initialized)
        {
            mountUSBDisk();
        }
        else
        {
            LOG("Skipping USB disk mount: SD init failed\n");
        }
#endif

        while (true)
        {
            vTaskDelay(1);

            update_status_led_file_server();
        }
        //============================================================================
    }

    s_shouldRestartRecording =  esp_timer_get_time() + 2000000;
    {
        //task will open AVI/MJPEF file for writing immediatelly if s_air_record=true
        int core = tskNO_AFFINITY;
        BaseType_t res = xTaskCreatePinnedToCore(&sd_write_proc, "SD Write", 4096, nullptr, 1, &s_sd_write_task, core);
        if (res != pdPASS)
        {
            LOG("Failed sd write task: %d\n", res);
        }
    }
    {
        int core = tskNO_AFFINITY;
        BaseType_t res = xTaskCreatePinnedToCore(&sd_enqueue_proc, "SD Enq", 1536, nullptr, 2, &s_sd_enqueue_task, core);
        if (res != pdPASS)
        {
            LOG("Failed sd enqueue task: %d\n", res);
        }
    }

#endif

#ifdef INIT_UART_1
    printf("Init UART1...\n");

    uart_config_t uart_config1 =
    {
        .baud_rate = UART1_BAUDRATE == MAVLINK_BAUDRATE_SETTING ? (int)s_mavlink_baudrate : UART1_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
#ifdef BOARD_ESP32C5
        .source_clk = UART_SCLK_RTC,
#else
        .source_clk = UART_SCLK_APB,
#endif
        .flags = 0
    };

    ESP_ERROR_CHECK(uart_param_config(UART_NUM_1, &uart_config1) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_1, UART1_RX_BUFFER_SIZE, UART1_TX_BUFFER_SIZE, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_1, TXD1_PIN, RXD1_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));

#endif

//initialize UART2 after SD
#ifdef INIT_UART_2
    printf("Init UART2...\n");

    uart_config_t uart_config2 =
    {
        .baud_rate = UART2_BAUDRATE == MAVLINK_BAUDRATE_SETTING ? (int)s_mavlink_baudrate : UART2_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
#ifdef BOARD_ESP32C5
        .source_clk = UART_SCLK_RTC,
#else
        .source_clk = UART_SCLK_APB,
#endif
        .flags = 0
    };

    ESP_ERROR_CHECK(uart_param_config(UART_NUM_2, &uart_config2) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_2, UART2_RX_BUFFER_SIZE, UART2_TX_BUFFER_SIZE, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_2, TXD2_PIN, RXD2_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
#endif

#ifdef INIT_LP_UART_NUM_0
    printf("Init LP_UART_NUM_0...\n");

    uart_config_t uart_config_lp0 =
    {
        .baud_rate = LUART0_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE, //This must be disabled for LP UART
        .rx_flow_ctrl_thresh = 0,              //This must be 0 when flow control is disabled
        .lp_source_clk = LP_UART_SCLK_DEFAULT,
        .flags = 0
    };

    ESP_ERROR_CHECK(uart_param_config(LP_UART_NUM_0, &uart_config_lp0));
    ESP_ERROR_CHECK(uart_driver_install(LP_UART_NUM_0, LP_UART0_RX_BUFFER_SIZE, LP_UART0_TX_BUFFER_SIZE, 0, NULL, 0));
#endif

    printf("MEMORY Before Loop: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);
    heap_caps_print_heap_info(MALLOC_CAP_DMA);

