RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    handle_ground2air_config_packetEx1( s_ground2air_config_packet);
    handle_ground2air_config_packetEx2( true);
    set_ground2air_config_packet_handler(handle_ground2air_config_packet);
    set_ground2air_connect_packet_handler(handle_ground2air_connect_packet);
    set_ground2air_data_packet_handler(handle_ground2air_data_packet);

    LOG("WIFI channel: %d (raw=%d)\n", getValidWifiChannel( s_ground2air_config_packet.dataChannel.wifi_channel), s_ground2air_config_packet.dataChannel.wifi_channel );

    temperature_sensor_init();

    //run_file_benchmark();

    //here camera_data_available callback will start receiving data, adding to SD buffer etc.
    s_initialized = true;

    while (true)
    {
        int dt = millis() - s_stats_last_tp;
        if (dt >= 1000)
        {
            s_stats_last_tp = millis();

            s_actual_capture_fps = (int)(s_stats.video_frames)* 1000 / dt;
            s_actual_capture_fps_expected = (int)(s_stats.video_frames_expected)* 1000 / dt;
            s_max_wlan_outgoing_queue_usage = getMaxWlanOutgoingQueueUsage();
            s_min_wlan_outgoing_queue_usage_seen = getMinWlanOutgoingQueueUsageSeen();
            
            s_stats.wlan_error_count += s_fec_wlan_error_count;
            s_fec_wlan_error_count = 0;

            if (s_uart_verbose > 0 )
            {
                //LOG is busy wait for ~11ms
                //ESP_LOGI is task yeld for ~13ms
                ESP_LOGI( "Main", "WLAN S: %u, R: %u, E: %u, F: %u, D: %u, %%: %d...%d || FPS: %d(%d), D: %u || SD D: %u, E: %u || TLM IN: %u OUT: %u\nSK1: %d SK2: %d, SK3: %d, Q: %d s: %u ovf:%d || sbg: %d || AIR: 0x%04x || GS: 0x%04x\n ",
                    (unsigned int)s_stats.wlan_data_sent, (unsigned int)s_stats.wlan_data_received, (unsigned int)s_stats.wlan_error_count, (unsigned int)s_stats.fec_spin_count,
                    (unsigned int)s_stats.wlan_received_packets_dropped, s_min_wlan_outgoing_queue_usage_seen, s_max_wlan_outgoing_queue_usage, 
                    s_actual_capture_fps, s_actual_capture_fps_expected, (unsigned int)s_stats.video_data, (unsigned int)s_stats.sd_data, (unsigned int)s_stats.sd_drops,
                    (unsigned int)s_stats.in_telemetry_data, (unsigned int)s_stats.out_telemetry_data,
                    (int)(s_quality_framesize_K1*100),  (int)(s_quality_framesize_K2*100), (int)(s_quality_framesize_K3*100),
                    s_quality, (unsigned int)((s_stats.camera_frame_size_min + s_stats.camera_frame_size_max)/2), cam_ovf_count, (int)s_dbg,
                    s_air_device_id, s_connected_gs_device_id); 
                print_cpu_usage();
            }

            s_max_frame_size = 0;
            //s_dbg = 0;

            if ( s_stats.fec_spin_count > 0 )
            {
                s_wifi_ovf_time = esp_timer_get_time();
            }

            s_last_stats = s_stats;
            s_stats = Stats();

            temperature_sensor_read(&s_camera_temperature);

            if ( s_camera_stopped_requested != s_camera_stopped )
            {
                s_camera_stopped = s_camera_stopped_requested;
                if ( s_camera_stopped )
                {
                    LOG("Camera stopped\n");
#if !defined(USE_MOCK_CAMERA)
                    esp_camera_deinit();
#endif                    
                }
                else
                {
                    LOG("Camera started\n");
#if !defined(USE_MOCK_CAMERA)
                    init_camera();
                    // Reinitialization restores the driver's default SVGA mode. Apply every
                    // configured sensor setting at the next completed frame, where camera
                    // settings are normally changed, to restore custom OV5640 modes safely.
                    s_force_camera_settings_requested = true;
#endif                    
                }
            }
        }

        dt = millis() - s_last_osd_packet_tp;
        if ( dt > 200 ) 
        {
            s_last_osd_packet_tp = millis();
            
            if ( s_camera_stopped )
            {
                s_fec_encoder.lock();

                // With no video frames, OSD packets are the air unit's only pong carrier.
                // Send one on every stopped-camera tick so GS does not report a false link loss.
                if ( !g_osd.isLocked() )
                {
                    send_air2ground_osd_packet();
                    s_osdUpdateCounter = 0;
                }
                else
                {
                    s_osdUpdateCounter++;
                }
                
                s_fec_encoder.unlock();
            }
        }

        vTaskDelay(10 / portTICK_PERIOD_MS);  //portTICK_PERIOD_MS = 10. Main task should call vTaskDelay(1) oherwise WDT will trigger in the idle task.

        //esp_task_wdt_reset();

        checkButton();

        update_status_led();

#ifdef ENABLE_PROFILER
        if ( s_profiler.full() || s_profiler.timedOut() )
        {
            LOG("Profiler stopped!\n");
            s_profiler.stop();
            s_profiler.save();
            s_profiler.clear();
        } 
#endif

/*
#ifdef UART_MAVLINK
        xSemaphoreTake(s_serial_mux, portMAX_DELAY);

        if ( s_video_frame_data_size == 0 &&  s_video_part_index == 0 )
        {
            while ( true )
            {
                size_t rs = 0;

                LOG("%d\n", rs);

                //if (rs >= MAX_TELEMETRY_PAYLOAD_SIZE) //TODO: or rs>0 and >agregation time
                if (rs >= 1) //TODO: or rs>0 and >agregation time
                {
                    if (!send_air2ground_data_packet()) break;
                }
                else
                {
                    break;
                }
            }
        }

        xSemaphoreGive(s_serial_mux);
#endif
*/

#ifdef UART_MSP_OSD
        //the msp.loop() should be called every ~10ms
        //115200 BAUD is 11520 bytes per second or 115 bytes per 10 ms
        //with UART RX buffer of 512 we are safe with periods 10...40ms
        g_msp.loop(s_ground2air_config_packet2.misc.mavlink2mspRC != 0);
#endif

#ifdef UART_MAVLINK
        send_mavlink_radio_status_if_idle();
#endif

        if ((s_restart_time!=0) && ( esp_timer_get_time()>s_restart_time))
        {
            esp_restart();
        }

