RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
#ifdef USE_MOCK_CAMERA
        mock_camera_process();
#endif


    }

}

/*
Air receive:
1) packet_received_cb()- called by Wifi library when wifi packet is received
  - feeds data to s_fec_decoder.decode_data(). No data type checking at all.

2) s_fec_decoder.decode_data()
 - allocates item in m_decoder.packet_pool
 - concatenates small packets until mtu size (because wifi packets may be broken to smaller parts by wifi layer)
 - enquees packets into m_decoder.packet_queue

3) decoder_task_proc()  
 - retrives item from m_decoder.packet_queue
 - inserts either in m_decoder.block_packets or m_decoder.block_fec_packets
 - inserts into s_wlan_incoming_queue either received or restored packets
 - signals s_wifi_rx_task

4) s_wifi_rx_task
  - parses packets: Ground2Air_Header::Type::Config, Ground2Air_Header::Type::Data
 

Air send:
1) camera_data_available callback from camera library
 - send_air2ground_video_packet() - passes Air2Ground_Video_Packet to s_fec_encode.
 - flush_encode_packet() - concatenates data until mtu size and passes to m_encoder.packet_queue
 
 2) encoder_task_proc()
  - gathers packets in m_encoder.block_packets
  - calls fec_encode(()
  - add_to_wlan_outgoing_queue() - places encoded packets into s_wlan_outgoing_queue

3) wifi_tx_proc
 - reads s_wlan_outgoing_queue
 - calls esp_wifi_80211_tx() 


//Here is a list of all tasks with their priorities:
// - Main task (app_main): Priority 1
// - SD Write task: Priority 1
// - SD Enqueue task: Priority 2
// - Wifi TX task: Priority 1
// - Wifi RX task: Priority 1
// - FEC Encoder task: Priority 1
// - FEC Decoder task: Priority 1

http://webgraphviz.com/

digraph G {
"camera_data_available" -> "s_fec_encoder"
"s_fec_encoder" -> "FEC Encoder task"
"FEC Encoder task" -> "Wifi TX task"
"camera_data_available" -> "add_to_sd_fast_buffer"
"add_to_sd_fast_buffer" -> "xTaskNotifyGive(s_sd_enqueue_task)"
"xTaskNotifyGive(s_sd_enqueue_task)" -> "ulTaskNotifyTake (SD Enqueue task)"
"ulTaskNotifyTake (SD Enqueue task)" -> "SD Enqueue task"
"SD Enqueue task" -> "xTaskNotifyGive(s_sd_write_task)"
"xTaskNotifyGive(s_sd_write_task)" -> "ulTaskNotifyTake (SD Write task)"
"ulTaskNotifyTake (SD Write task)" -> "SD Write task"
"SD Enqueue task" -> "s_sd_slow_buffer_mux"
"s_sd_slow_buffer_mux" -> "SD Write task"
"packet_received_cb" -> "s_fec_decoder"
"s_fec_decoder" -> "FEC Decoder task"
"FEC Decoder task" -> "Wifi RX task"
}
*/
